In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("scooter.csv")
df.columns

Index(['month', 'trip_id', 'region_id', 'vehicle_id', 'started_at', 'ended_at',
       'DURATION', 'start_location_name', 'end_location_name', 'user_id',
       'trip_ledger_id'],
      dtype='object')

In [3]:
df.dtypes

month                  object
trip_id                 int64
region_id               int64
vehicle_id              int64
started_at             object
ended_at               object
DURATION               object
start_location_name    object
end_location_name      object
user_id                 int64
trip_ledger_id          int64
dtype: object

In [4]:
df.head()

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
0,May,1613335,202,9424537,5/21/2019 18:33,5/21/2019 18:40,0:07:03,"1901 Roma Ave NE, Albuquerque, NM 87106, USA","1899 Roma Ave NE, Albuquerque, NM 87106, USA",8417864,1488546
1,May,1613639,202,9424537,5/21/2019 19:07,5/21/2019 19:12,0:04:57,"1 Domenici Center en Domenici Center, Albuquer...","1111 Stanford Dr NE, Albuquerque, NM 87106, USA",8417864,1488838
2,May,1613708,202,9424537,5/21/2019 19:13,5/21/2019 19:15,0:01:14,"1 Domenici Center en Domenici Center, Albuquer...","1 Domenici Center en Domenici Center, Albuquer...",8417864,1488851
3,May,1613867,202,9424537,5/21/2019 19:29,5/21/2019 19:36,0:06:58,"Rotunda at Science & Technology Park, 801 Univ...","725 University Blvd SE, Albuquerque, NM 87106,...",8417864,1489064
4,May,1636714,202,8926493,5/24/2019 13:38,5/24/2019 13:41,0:03:06,"401 2nd St NW, Albuquerque, NM 87102, USA","401 2nd St NW, Albuquerque, NM 87102, USA",35436274,1511212

In [5]:
df[['DURATION','user_id']]

      DURATION   user_id
0      0:07:03   8417864
1      0:04:57   8417864
2      0:01:14   8417864
3      0:06:58   8417864
4      0:03:06  35436274
...        ...       ...
34221  0:14:00  42559731
34222  0:08:00  42457674
34223  1:53:00  42576631
34224  0:12:00  42575656
34225  1:51:00  42586810

[34226 rows x 2 columns]

In [6]:
df.sample()

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
14232,June,1905933,202,5192526,6/13/2019 19:30,6/13/2019 20:12,0:41:39,"Central @ Tingley, Albuquerque, NM 87104, USA","Central @ New York, Albuquerque, NM 87104, USA",39077053,1772811

In [15]:
df[5:10]

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
5,May,1636780,202,3902020,5/24/2019 13:52,5/24/2019 14:13,0:21:27,"520 Central Ave SW, Albuquerque, NM 87102, USA","3217 Pershing Ave SE, Albuquerque, NM 87106, USA",34352757,1511371
6,May,1636856,202,5192526,5/24/2019 14:04,5/24/2019 14:34,0:30:43,"330 Tijeras Ave NW, Albuquerque, NM 87102, USA","809 Copper Ave NW, Albuquerque, NM 87102, USA",35466666,1511483
7,May,1636912,202,3902020,5/24/2019 14:14,5/24/2019 14:15,0:01:05,"3217 Pershing Ave SE, Albuquerque, NM 87106, USA","802 Wellesley Dr SE, Albuquerque, NM 87106, USA",34352757,1511390
8,May,1637035,202,5192526,5/24/2019 14:37,5/24/2019 14:43,0:05:33,"809 Copper Ave NW, Albuquerque, NM 87102, USA","809 Copper Ave NW, Albuquerque, NM 87102, USA",35466666,1511516
9,May,1637036,202,9885684,5/24/2019 14:38,5/24/2019 15:09,0:31:54,"2901 Central Ave NE, Albuquerque, NM 87106, USA","2000 Zearing Ave NW, Albuquerque, NM 87104, USA",34352757,1511666

In [9]:
df.loc[52]
df.loc[52]

month                                                              May
trip_id                                                        1639024
region_id                                                          202
vehicle_id                                                     8343821
started_at                                             5/24/2019 17:44
ended_at                                               5/24/2019 18:06
DURATION                                                       0:22:00
start_location_name     330 Tijeras Ave NW, Albuquerque, NM 87102, USA
end_location_name      1224 Central Ave SW, Albuquerque, NM 87102, USA
user_id                                                       35519604
trip_ledger_id                                                 1513623
Name: 52, dtype: object

In [10]:
df.at[2,'start_location_name']

'1 Domenici Center en Domenici Center, Albuquerque, NM 87106, USA'

In [16]:
df.loc[2,['DURATION','trip_id']]

DURATION    0:01:14
trip_id     1613708
Name: 2, dtype: object

In [17]:
df.where(df['user_id'] == 34352757)

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
34221,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34222,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34223,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34224,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34225,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
df[(df['user_id'] == 34352757)&(df['vehicle_id']==3902020)]

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
5,May,1636780,202,3902020,5/24/2019 13:52,5/24/2019 14:13,0:21:27,"520 Central Ave SW, Albuquerque, NM 87102, USA","3217 Pershing Ave SE, Albuquerque, NM 87106, USA",34352757,1511371
7,May,1636912,202,3902020,5/24/2019 14:14,5/24/2019 14:15,0:01:05,"3217 Pershing Ave SE, Albuquerque, NM 87106, USA","802 Wellesley Dr SE, Albuquerque, NM 87106, USA",34352757,1511390

In [27]:
#useful for numeric data like ages
df.describe()

            trip_id  region_id    vehicle_id       user_id  trip_ledger_id
count  3.422600e+04    34226.0  3.422600e+04  3.422600e+04    3.422600e+04
mean   2.004438e+06      202.0  5.589507e+06  3.875420e+07    1.869549e+06
std    2.300476e+05        0.0  2.627164e+06  4.275441e+06    2.252639e+05
min    1.613335e+06      202.0  1.034847e+06  1.080200e+04    1.488546e+06
25%    1.813521e+06      202.0  3.260435e+06  3.665710e+07    1.683023e+06
50%    1.962520e+06      202.0  5.617097e+06  3.880750e+07    1.827796e+06
75%    2.182324e+06      202.0  8.012871e+06  4.222774e+07    2.042524e+06
max    2.482335e+06      202.0  9.984848e+06  4.258732e+07    2.342161e+06

In [23]:

df['start_location_name'].describe()

count                                               34220
unique                                               2972
top       1898 Mountain Rd NW, Albuquerque, NM 87104, USA
freq                                                 1210
Name: start_location_name, dtype: object

In [25]:

df['start_location_name'].value_counts()

1898 Mountain Rd NW, Albuquerque, NM 87104, USA      1210
Central @ Tingley, Albuquerque, NM 87104, USA         920
2550 Central Ave NE, Albuquerque, NM 87106, USA       848
2901 Central Ave NE, Albuquerque, NM 87106, USA       734
330 Tijeras Ave NW, Albuquerque, NM 87102, USA        671
                                                     ...
416 High St SE, Albuquerque, NM 87102, USA              1
1017 Forrester Ave NW, Albuquerque, NM 87102, USA       1
1331 Park Ave SW, Albuquerque, NM 87102, USA            1
66 Romero St NW, Albuquerque, NM 87104, USA             1
5407 Central Ave NW, Albuquerque, NM 87105, USA         1
Name: start_location_name, Length: 2972, dtype: int64

In [30]:
df['DURATION'].value_counts(normalize=True)

0:04:00     0.025847
0:03:00     0.025284
0:05:00     0.022808
0:06:00     0.020333
0:07:00     0.019644
              ...
0:40:15     0.000031
39:24:42    0.000031
0:43:09     0.000031
1:05:10     0.000031
1:12:07     0.000031
Name: DURATION, Length: 4135, dtype: float64

In [31]:
df['DURATION'].value_counts(dropna=False)

NaN         2308
0:04:00      825
0:03:00      807
0:05:00      728
0:06:00      649
            ...
0:37:21        1
1:25:37        1
0:40:15        1
39:24:42       1
1:27:19        1
Name: DURATION, Length: 4136, dtype: int64

In [28]:
df['DURATION'].describe()

count       31918
unique       4135
top       0:04:00
freq          825
Name: DURATION, dtype: object

In [6]:
df['end_location_name'].value_counts(dropna=False)

NaN                                                  2070
1898 Mountain Rd NW, Albuquerque, NM 87104, USA       802
Central @ Tingley, Albuquerque, NM 87104, USA         622
330 Tijeras Ave NW, Albuquerque, NM 87102, USA        529
2550 Central Ave NE, Albuquerque, NM 87106, USA       478
                                                     ...
116 Washington St SE, Albuquerque, NM 87108, USA        1
716 Commercial St SE, Albuquerque, NM 87102, USA        1
119 Walter St SE, Albuquerque, NM 87102, USA            1
3801 Carlisle Blvd NE, Albuquerque, NM 87107, USA       1
1413 4th St SW, Albuquerque, NM 87102, USA              1
Name: end_location_name, Length: 4264, dtype: int64

In [37]:
from faker import Faker
fake = Faker()
data = []
for i in range(1000):
    data.append({'name':fake.name(),'age':fake.random_int(min=18,max=60)})

df1 = pd.DataFrame(data,columns=['name','age'])
df1

                  name  age
0     Curtis Hernandez   37
1     Veronica Oconnor   18
2        Walter Turner   41
3    Carrie Pennington   56
4      Stephanie Woods   53
..                 ...  ...
995     Shaun Sandoval   47
996   Stephanie Medina   47
997       Amanda Doyle   55
998         John White   58
999        Carl Rogers   58

[1000 rows x 2 columns]

In [38]:
df1['age'].value_counts(bins=10)

(34.8, 39.0]                  119
(43.2, 47.4]                  116
(17.956999999999997, 22.2]    107
(26.4, 30.6]                  106
(55.8, 60.0]                  106
(39.0, 43.2]                   96
(47.4, 51.6]                   92
(22.2, 26.4]                   90
(51.6, 55.8]                   86
(30.6, 34.8]                   82
Name: age, dtype: int64

In [32]:
df['end_location_name'].isnull().sum()

2070

In [33]:
df.isnull().sum()

month                     0
trip_id                   0
region_id                 0
vehicle_id                0
started_at                0
ended_at                  0
DURATION               2308
start_location_name       6
end_location_name      2070
user_id                   0
trip_ledger_id            0
dtype: int64

In [8]:
df.drop(columns=['region_id'],inplace=True)

In [39]:
df['start_location_name'].isnull().sum()

6

In [41]:
df['start_location_name'][(df['start_location_name'].isnull())]

26042    NaN
26044    NaN
26046    NaN
26048    NaN
26051    NaN
26053    NaN
Name: start_location_name, dtype: object

In [43]:
df2 = df.dropna(axis = 0, how = 'any', subset=['start_location_name'],inplace=False)

In [48]:
len(df2)

34220

In [47]:
df['start_location_name'][(df['start_location_name'].isnull())]

26042    NaN
26044    NaN
26046    NaN
26048    NaN
26051    NaN
26053    NaN
Name: start_location_name, dtype: object

In [49]:
df3 = df[(df['start_location_name'].isnull())&(df['end_location_name'].isnull())]

In [50]:
value = {'start_location_name':'Start St.','end_location_name':'Stop St.'}
df3.fillna(value=value)

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
26042,July,2199535,202,8631912,7/5/2019 0:15,7/5/2019 0:17,0:02:00,Start St.,Stop St.,42392720,2058097
26044,July,2199602,202,6421094,7/5/2019 0:17,7/5/2019 0:30,0:13:00,Start St.,Stop St.,42244871,2058532
26046,July,2199615,202,8742883,7/5/2019 0:17,7/5/2019 0:30,0:13:00,Start St.,Stop St.,39632386,2058536
26048,July,2199795,202,7997871,7/5/2019 0:22,7/5/2019 0:24,0:02:00,Start St.,Stop St.,42202181,2058326
26051,July,2200180,202,6331987,7/5/2019 0:34,7/5/2019 0:44,0:10:00,Start St.,Stop St.,36035061,2059005
26053,July,2200193,202,1034847,7/5/2019 0:34,7/5/2019 0:36,0:02:00,Start St.,Stop St.,42135727,2058723

In [51]:
df[(df['start_location_name'].isnull())&(df['end_location_name'].isnull())]

,month,trip_id,region_id,vehicle_id,started_at,ended_at,DURATION,start_location_name,end_location_name,user_id,trip_ledger_id
26042,July,2199535,202,8631912,7/5/2019 0:15,7/5/2019 0:17,0:02:00,NaN,NaN,42392720,2058097
26044,July,2199602,202,6421094,7/5/2019 0:17,7/5/2019 0:30,0:13:00,NaN,NaN,42244871,2058532
26046,July,2199615,202,8742883,7/5/2019 0:17,7/5/2019 0:30,0:13:00,NaN,NaN,39632386,2058536
26048,July,2199795,202,7997871,7/5/2019 0:22,7/5/2019 0:24,0:02:00,NaN,NaN,42202181,2058326
26051,July,2200180,202,6331987,7/5/2019 0:34,7/5/2019 0:44,0:10:00,NaN,NaN,36035061,2059005
26053,July,2200193,202,1034847,7/5/2019 0:34,7/5/2019 0:36,0:02:00,NaN,NaN,42135727,2058723

In [54]:
may = df[(df['month']=='May')]
may.count()

month                  4225
trip_id                4225
region_id              4225
vehicle_id             4225
started_at             4225
ended_at               4225
DURATION               4225
start_location_name    4225
end_location_name      4176
user_id                4225
trip_ledger_id         4225
dtype: int64

In [55]:
df5 = df.drop(index=may.index)

In [56]:
df5['month'].value_counts()

June    20259
July     9742
Name: month, dtype: int64

In [59]:
df.columns = [i.lower() for i in df.columns]
df.columns

Index(['month', 'trip_id', 'region_id', 'vehicle_id', 'started_at', 'ended_at',
       'duration', 'start_location_name', 'end_location_name', 'user_id',
       'trip_ledger_id'],
      dtype='object')

In [60]:
df.rename({'DURATION':'duration'},inplace=True) #used for multiple columns

In [63]:
df.loc[df['start_location_name']=='1898 Mountain Rd NW, Albuquerque, NM 87104, USA','new_column'] = 'Yes'
df.loc[df['start_location_name']!='1898 Mountain Rd NW, Albuquerque, NM 87104, USA','new_column'] = 'No'
df.loc[df['start_location_name']=='1898 Mountain Rd NW, Albuquerque, NM 87104, USA']

,month,trip_id,region_id,vehicle_id,started_at,ended_at,duration,start_location_name,end_location_name,user_id,trip_ledger_id,new_column
13,May,1637299,202,3027855,5/24/2019 15:16,5/24/2019 15:36,0:20:12,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","824 Stover Ave SW, Albuquerque, NM 87102, USA",34352757,1511876,Yes
147,May,1640777,202,1041057,5/24/2019 19:31,5/24/2019 19:38,0:07:17,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1801 18th St NW, Albuquerque, NM 87104, USA",35539988,1515037,Yes
209,May,1642253,202,8919242,5/24/2019 20:51,5/24/2019 21:36,0:44:29,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1898 Mountain Rd NW, Albuquerque, NM 87104, USA",35559692,1517116,Yes
212,May,1642286,202,5410226,5/24/2019 20:53,5/24/2019 21:36,0:43:22,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1898 Mountain Rd NW, Albuquerque, NM 87104, USA",35559949,1517118,Yes
233,May,1642714,202,1455340,5/24/2019 21:15,5/24/2019 21:56,0:41:30,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1898 Mountain Rd NW, Albuquerque, NM 87104, USA",35564036,1517516,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...
33866,July,2467256,202,5188380,7/21/2019 2:39,7/21/2019 3:26,0:47:00,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1898 Mountain Rd NW, Albuquerque, NM 87104, USA",37731018,2326057,Yes
34051,July,2477231,202,7932231,7/21/2019 20:42,7/21/2019 20:44,0:02:00,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1898 Mountain Rd NW, Albuquerque, NM 87104, USA",41414913,2334807,Yes
34054,July,2477309,202,5812897,7/21/2019 20:45,7/21/2019 20:52,0:07:00,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","Tiguex Park, 1800 Mountain Rd NW, Albuquerque,...",41414913,2335032,Yes
34055,July,2477313,202,2774397,7/21/2019 20:45,7/21/2019 21:00,0:15:00,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA",NaN,42584654,2335253,Yes
34087,July,2479158,202,3312785,7/21/2019 21:55,7/21/2019 23:03,1:08:00,"1898 Mountain Rd NW, Albuquerque, NM 87104, USA","1800 Old Town Rd NW, Albuquerque, NM 87104, USA",42583970,2338415,Yes

In [68]:
df['started_at'] = pd.to_datetime(df['started_at'], format="%m/%d/%Y %H:%M")
df['ended_at'] = pd.to_datetime(df['ended_at'], format="%m/%d/%Y %H:%M")

In [69]:
df.dtypes

month                          object
trip_id                         int64
region_id                       int64
vehicle_id                      int64
started_at             datetime64[ns]
ended_at               datetime64[ns]
duration                       object
start_location_name            object
end_location_name              object
user_id                         int64
trip_ledger_id                  int64
new_column                     object
dtype: object